a = int(input('Первое число - '))
b = int(input('Второе число - '))
c = int(input('Третье число - '))
if a > 0:
    print(f'Неотрицательное число a в квадрате - {a ** 2}')
else:
    print(f'Отрицательное число a в квадрате - {a ** 4}\n')
if b > 0:
    print(f'Неотрицательное число b в квадрате - {b ** 2}')
else:
    print(f'Отрицательное число b в квадрате - {b ** 4}\n')
if c > 0:
    print(f'Неотрицательное число c в квадрате - {c ** 2}')
else:
    print(f'Отрицательное число c в квадрате - {c ** 4}')
